/*
INSERT INTO PartInfoMain (id, last_name, first_name, thrests_name) VALUES
(1, "Иванов", "Иван", "Иванович"),
(2, "Петров", "Петр", "Петрович"),
(3, "Сидоров", "Сидор", "Сидорович"),
(4, "Кузнецова", "Елена", "Андреевна"),
(5, "Федоров", "Федор", "Федорович"),
(6, "Григорьева", "Мария", "Александровна"),
(7, "Васильев", "Василий", "Петрович"),
(8, "Смирнова", "Анна", "Сергеевна"),
(9, "Глушков", "Артем", "Александрович"),
(10, "Попов", "Алексей", "Николаевич");

INSERT INTO WorkInfo (id, scien_degree, scien_title, scien_field, id_univer, division, post) VALUES
(1, "доктор наук", "профессор", "физика", 1, "физический факультет", "заведующий кафедрой"),
(2, "кандидат наук", "доцент", "математика", 2, "институт мировой экономики и мировой политики", "доцент"),
(3, "кандидат наук", "старший научный сотрудник", "биология", 3, "", "старший научный сотрудник"),
(4, "доктор наук", "профессор", "химия", 4, "химический факультет", "заведующий кафедрой"),
(5, "кандидат наук", "доцент", "информатика", 5, "факультет компьютерных наук", "доцент"),
(6, "доктор наук", "профессор", "филология", 6, "", "профессор"),
(7, "доктор наук", "профессор", "физика", 1, "физический факультет", "профессор"),
(8, "кандидат наук", "доцент", "экономика", 5, "факультет экономики", "доцент"),
(9, "кандидат наук", "старший научный сотрудник", "информатика", 7, "", "старший научный сотрудник"),
(10, "кандидат наук", "старший научный сотрудник", "физика", 8, "", "старший научный сотрудник");

INSERT INTO PersInfo (id, country, id_sity, post_code, addres, work_phone, home_phone, email) VALUES
(1, "Россия", 1, 119991, "Ленинские горы, МГУ, ГЗ", "+7-495-555-55-55", "+7-495-123-45-67", "ivan.ivanov@mgu.ru"),
(2, "Россия", 1, 119034, "Ленинские горы, 1-ый км МКАД", "+7-495-123-45-67", "+7-495-777-77-77", "petr.petrov@mgimo.ru"),
(3, "Россия", 2, 119334, "ул. Губкина, 2/1", "+7-495-888-88-88", "+7-495-123-45-67", "sidor.sidorov@biogen.ru"),
(4, "Россия", 3, 199991, "Менделеевская, 5", "+7-495-444-44-44", "+7-495-123-45-67", "elena.kuznecova@spbu.ru"),
(5, "Россия", 1, 101000, "ул. Мясницкая, 20, стр. 2", "+7-495-555-55-55", "+7-495-123-45-67", "fedor.fedorov@hse.ru"),
(6, "Россия", 3, 198504, "Кронверкский проспект, 49", "+7-812-123-45-67", "+7-812-777-77-77", "maria.grigoreva@itmo.ru"),
(7, "Россия", 1, 117234, "Ленинские горы, МГУ, ГЗ", "+7-495-999-99-99", "+7-495-123-45-67", "vasili.vasiliev@mgu.ru"),
(8, "Россия", 1, 101000, "ул. Мясницкая, 20, стр. 1", "+7-495-123-45-67", "+7-495-777-77-77", "anna.smirnova@hse.ru"),
(9, "Россия", 4, 123182, "Академика Курчатова, 1", "+7-495-123-45-67", "+7-495-999-99-99", "artem.glushkov@urfu.ru"),
(10, "Россия", 5, 123098, "Ленинградский проспект, 23, стр. 1", "+7-495-123-45-67", "+7-495-777-77-77", "aleksey.popov@dvfu.edu");

INSERT INTO Sity (id_sity, name_sity) VALUES
(1, "Москва"),
(2, "Казань"),
(3, "Санкт-Петербург"),
(4, "Екатеринбург"),
(5, "Владивосток");

INSERT INTO University (id_univer, name_univer) VALUES
(1, "МГУ"),
(2, "МГИМО"),
(3, "ИБ-РАН"),
(4, "СПбГУ"),
(5, "НИУ ВШЭ"),
(6, "ИТМО"),
(7, "УРФУ"),
(8, "ДВФУ");

INSERT INTO ConfPartMain (id, partType, speechTopic, absReceived) VALUES 
(1, "Докладчик", "Квантовая теория поля и ее применение в астрофизике", FALSE),
(2, "Соавтор", "Анализ и интерпретация экспериментальных данных в области наноматериалов", TRUE),
(3, "Докладчик", "Моделирование физико-химических процессов в жидкокристаллических системах", FALSE),
(4, "Соавтор", "Математическое моделирование биологических систем", TRUE),
(5, "Докладчик", "Новые алгоритмы машинного обучения для задач классификации изображений", FALSE),
(6, "Докладчик", "Развитие современных методов дистанционного зондирования Земли", FALSE),
(7, "Докладчик", "Фазовые переходы в квантовых системах", FALSE),
(8, "Соавтор", "Оптимизация финансовых рисков", TRUE),
(9, "Соавтор", "Создание компьютерной модели сетей для управления транспортным потоком", FALSE),
(10, "Докладчик", "Анализ остаточных предложений в языке как повод для обновления учебно-методических материалов", FALSE);

INSERT INTO ConfPartDetail (id, firstInvitationDate, applicationReceiptDate, secondInvitationDate, feeReceiptDate, feeAmount) VALUES 
(1, '2021-05-20', '2021-06-07', '2021-06-25', '2021-07-13', 2500),
(2, '2021-06-01', '2021-06-18', '2021-07-07', '2021-07-28', 1800),
(3, '2021-05-24', '2021-06-15', '2021-07-03', '2021-07-21', 2000),
(4, '2021-06-08', '2021-06-29', '2021-07-16', '2021-08-03', 2200),
(5, '2021-05-18', '2021-06-10', '2021-06-29', '2021-07-19', 1500),
(6, '2021-05-25', '2021-06-21', '2021-07-08', '2021-07-29', 2800),
(7, '2021-05-20', '2021-06-02', '2021-06-22', '2021-07-15', 1900),
(8, '2021-06-01', '2021-06-25', '2021-07-13', '2021-08-04', 2700),
(9, '2021-06-07', '2021-06-30', '2021-07-17', '2021-08-06', 1900),
(10, '2021-05-26', '2021-06-14', '2021-07-02', '2021-07-21', 2300);

INSERT INTO ConfPartAdd (id, arrivalDate, departureDate, hotelNeeded) VALUES 
(1, '2021-08-17', '2021-08-22', TRUE),
(2, '2021-08-21', '2021-08-24', FALSE),
(3, '2021-08-18', '2021-08-21', TRUE),
(4, '2021-08-19', '2021-08-23', TRUE),
(5, '2021-08-15', '2021-08-19', TRUE),
(6, '2021-08-18', '2021-08-23', TRUE),
(7, '2021-08-19', '2021-08-25', TRUE),
(8, '2021-08-22', '2021-08-26', FALSE),
(9, '2021-08-16', '2021-08-21', TRUE),
(10, '2021-08-17', '2021-08-20', FALSE);

*/
// ---------

INSERT INTO Part_Info_Main (id, last_name, first_name, thrests_name) VALUES
(1, "Иванов", "Иван", "Иванович"),
(2, "Петров", "Петр", "Петрович"),
(3, "Сидоров", "Сидор", "Сидорович"),
(4, "Кузнецова", "Елена", "Андреевна"),
(5, "Федоров", "Федор", "Федорович"),
(6, "Григорьева", "Мария", "Александровна"),
(7, "Васильев", "Василий", "Петрович"),
(8, "Смирнова", "Анна", "Сергеевна"),
(9, "Глушков", "Артем", "Александрович"),
(10, "Попов", "Алексей", "Николаевич");

INSERT INTO WorkInfo (id, scien_degree, scien_title, scien_field, id_univer, division, post) VALUES
(1, "доктор наук", "профессор", "физика", 1, "физический факультет", "заведующий кафедрой"),
(2, "кандидат наук", "доцент", "математика", 2, "институт мировой экономики и мировой политики", "доцент"),
(3, "кандидат наук", "старший научный сотрудник", "биология", 3, "", "старший научный сотрудник"),
(4, "доктор наук", "профессор", "химия", 4, "химический факультет", "заведующий кафедрой"),
(5, "кандидат наук", "доцент", "информатика", 5, "факультет компьютерных наук", "доцент"),
(6, "доктор наук", "профессор", "филология", 6, "", "профессор"),
(7, "доктор наук", "профессор", "физика", 1, "физический факультет", "профессор"),
(8, "кандидат наук", "доцент", "экономика", 5, "факультет экономики", "доцент"),
(9, "кандидат наук", "старший научный сотрудник", "информатика", 7, "", "старший научный сотрудник"),
(10, "кандидат наук", "старший научный сотрудник", "физика", 8, "", "старший научный сотрудник");

INSERT INTO Pers_Info (id, country, id_sity, post_code, addres, work_phone, home_phone, email) VALUES
(1, "Россия", 1, 119991, "Ленинские горы, МГУ, ГЗ", "+7-495-555-55-55", "+7-495-123-45-67", "ivan.ivanov@mgu.ru"),
(2, "Россия", 1, 119034, "Ленинские горы, 1-ый км МКАД", "+7-495-123-45-67", "+7-495-777-77-77", "petr.petrov@mgimo.ru"),
(3, "Россия", 2, 119334, "ул. Губкина, 2/1", "+7-495-888-88-88", "+7-495-123-45-67", "sidor.sidorov@biogen.ru"),
(4, "Россия", 3, 199991, "Менделеевская, 5", "+7-495-444-44-44", "+7-495-123-45-67", "elena.kuznecova@spbu.ru"),
(5, "Россия", 1, 101000, "ул. Мясницкая, 20, стр. 2", "+7-495-555-55-55", "+7-495-123-45-67", "fedor.fedorov@hse.ru"),
(6, "Россия", 3, 198504, "Кронверкский проспект, 49", "+7-812-123-45-67", "+7-812-777-77-77", "maria.grigoreva@itmo.ru"),
(7, "Россия", 1, 117234, "Ленинские горы, МГУ, ГЗ", "+7-495-999-99-99", "+7-495-123-45-67", "vasili.vasiliev@mgu.ru"),
(8, "Россия", 1, 101000, "ул. Мясницкая, 20, стр. 1", "+7-495-123-45-67", "+7-495-777-77-77", "anna.smirnova@hse.ru"),
(9, "Россия", 4, 123182, "Академика Курчатова, 1", "+7-495-123-45-67", "+7-495-999-99-99", "artem.glushkov@urfu.ru"),
(10, "Россия", 5, 123098, "Ленинградский проспект, 23, стр. 1", "+7-495-123-45-67", "+7-495-777-77-77", "aleksey.popov@dvfu.edu");

INSERT INTO Sity (id_sity, name_sity) VALUES
(1, "Москва"),
(2, "Казань"),
(3, "Санкт-Петербург"),
(4, "Екатеринбург"),
(5, "Владивосток");

INSERT INTO University (id_univer, name_univer) VALUES
(1, "МГУ"),
(2, "МГИМО"),
(3, "ИБ-РАН"),
(4, "СПбГУ"),
(5, "НИУ ВШЭ"),
(6, "ИТМО"),
(7, "УРФУ"),
(8, "ДВФУ");

INSERT INTO name_of_conf VALUES
(1,  "Наука и техника будущего"),
(2,  "Квантовая механика"),
(3,  "Физика в нашей жизни");

INSERT INTO Conf_Part_Main (id, partType, speechTopic, absReceived) VALUES 
(1, "Докладчик", "Квантовая теория поля и ее применение в астрофизике", FALSE),
(2, "Соавтор", "Анализ и интерпретация экспериментальных данных в области наноматериалов", TRUE),
(3, "Докладчик", "Моделирование физико-химических процессов в жидкокристаллических системах", FALSE),
(4, "Соавтор", "Математическое моделирование биологических систем", TRUE),
(5, "Докладчик", "Новые алгоритмы машинного обучения для задач классификации изображений", FALSE),
(6, "Докладчик", "Развитие современных методов дистанционного зондирования Земли", FALSE),
(7, "Докладчик", "Фазовые переходы в квантовых системах", FALSE),
(8, "Соавтор", "Оптимизация финансовых рисков", TRUE),
(9, "Соавтор", "Создание компьютерной модели сетей для управления транспортным потоком", FALSE),
(10, "Докладчик", "Анализ остаточных предложений в языке как повод для обновления учебно-методических материалов", FALSE);

INSERT INTO Conf_Part_Detail (id, firstInvitationDate, applicationReceiptDate, secondInvitationDate, feeReceiptDate, feeAmount) VALUES 
(1, '2021-05-20', '2021-06-07', '2021-06-25', '2021-07-13', 2500),
(2, '2021-06-01', '2021-06-18', '2021-07-07', '2021-07-28', 1800),
(3, '2021-05-24', '2021-06-15', '2021-07-03', '2021-07-21', 2000),
(4, '2021-06-08', '2021-06-29', '2021-07-16', '2021-08-03', 2200),
(5, '2021-05-18', '2021-06-10', '2021-06-29', '2021-07-19', 1500),
(6, '2021-05-25', '2021-06-21', '2021-07-08', '2021-07-29', 2800),
(7, '2021-05-20', '2021-06-02', '2021-06-22', '2021-07-15', 1900),
(8, '2021-06-01', '2021-06-25', '2021-07-13', '2021-08-04', 2700),
(9, '2021-06-07', '2021-06-30', '2021-07-17', '2021-08-06', 1900),
(10, '2021-05-26', '2021-06-14', '2021-07-02', '2021-07-21', 2300);

INSERT INTO Conf_Part_Add (id, arrivalDate, departureDate, hotelNeeded) VALUES 
(1, '2021-08-17', '2021-08-22', TRUE),
(2, '2021-08-21', '2021-08-24', FALSE),
(3, '2021-08-18', '2021-08-21', TRUE),
(4, '2021-08-19', '2021-08-23', TRUE),
(5, '2021-08-15', '2021-08-19', TRUE),
(6, '2021-08-18', '2021-08-23', TRUE),
(7, '2021-08-19', '2021-08-25', TRUE),
(8, '2021-08-22', '2021-08-26', FALSE),
(9, '2021-08-16', '2021-08-21', TRUE),
(10, '2021-08-17', '2021-08-20', FALSE);
